src/cfe/ОбменССайтом/InformationRegisters/ос_ИсторияИзмененияОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ос_ИсторияИзмененияОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ос_НастройкиОбменаССайтами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/ОбменССайтом/InformationRegisters/ос_ИсторияИзмененияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>ос_ИсторияИзмененияЦен</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ос_НастройкиОбменаССайтами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/ОбменССайтом/Catalogs/ос_НастройкиОбменаССайтами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>ос_НастройкиОбменаССайтами</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроек</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ос_ТипыОбменовССайтами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзмененияОстатков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзмененияЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/ОбменССайтом/CommonModules/ос_РегистрацияИзмененийРегистры/Ext/Module.bsl
Процедура ПолучитьИзмененияОстатков(НастройкаОбмена, ДатаВыгрузки, МенеджерВТ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ос_ИсторияИзмененияОстатков.Номенклатура КАК Номенклатура,
	               |	ос_ИсторияИзмененияОстатков.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ втНоменклатураХарактеристика
	               |ИЗ
	               |	РегистрСведений.ос_ИсторияИзмененияОстатков КАК ос_ИсторияИзмененияОстатков
	               |ГДЕ
	               |	ос_ИсторияИзмененияОстатков.НастройкаОбмена = &НастройкаОбмена
	               |	И ос_ИсторияИзмененияОстатков.НастройкаОбмена <= &ДатаВыгрузки";
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	Запрос.УстановитьПараметр("ДатаВыгрузки", ДатаВыгрузки);
	РезультатЗапроса = Запрос.Выполнить();
		
КонецПроцедуры

Процедура ЗаписатьИзмененияОтстатков(Склад, Номенклатура, Характеристика) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ос_НастройкиОбменаССайтами.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ос_НастройкиОбменаССайтами КАК ос_НастройкиОбменаССайтами
	               |ГДЕ
	               |	НЕ ос_НастройкиОбменаССайтами.ПометкаУдаления
	               |	И ос_НастройкиОбменаССайтами.РегистрироватьИзмененияОстатков";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписатьИзмененияОтстатковПоНастройкеОбмена(Выборка.Ссылка, Склад, Номенклатура, Характеристика);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаписатьИзмененияОтстатковПоНастройкеОбмена(НастройкаОбмена, Склад, Номенклатура, Характеристика)
	
	МЗ = РегистрыСведений.ос_ИсторияИзмененияОстатков.СоздатьМенеджерЗаписи();
	МЗ.Дата = ТекущаяДата();
	МЗ.НастройкаОбмена = НастройкаОбмена;
	МЗ.Склад = Склад;
	МЗ.Номенклатура = Номенклатура;
	МЗ.Характеристика = Характеристика;
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьИзмененияОстатковДоДаты(НастройкаОбмена, ДатаОкончания) Экспорт
	
	Если ДатаОкончания = Дата(1,1,1) 
		ИЛИ ДатаОкончания = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ос_ИсторияИзмененияОстатков.НастройкаОбмена КАК НастройкаОбмена,
	               |	ос_ИсторияИзмененияОстатков.Склад КАК Склад,
	               |	ос_ИсторияИзмененияОстатков.Номенклатура КАК Номенклатура,
	               |	ос_ИсторияИзмененияОстатков.Характеристика КАК Характеристика,
	               |	ос_ИсторияИзмененияОстатков.Дата КАК Дата
	               |ИЗ
	               |	РегистрСведений.ос_ИсторияИзмененияОстатков КАК ос_ИсторияИзмененияОстатков
	               |ГДЕ
	               |	ос_ИсторияИзмененияОстатков.НастройкаОбмена = &НастройкаОбмена
	               |	И ос_ИсторияИзмененияОстатков.Дата <= &ДатаОкончания";
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.ос_ИсторияИзмененияОстатков.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка); 
		МЗ.Удалить();
		
	КонецЦикла;
		
КонецПроцедуры

//--

Процедура ПолучитьИзмененияЦен(НастройкаОбмена, ДатаВыгрузки, МенеджерВТ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ос_ИсторияИзмененияЦен.Номенклатура КАК Номенклатура,
	               |	ос_ИсторияИзмененияЦен.Характеристика КАК Характеристика
	               |ПОМЕСТИТЬ втНоменклатураХарактеристика
	               |ИЗ
	               |	РегистрСведений.ос_ИсторияИзмененияЦен КАК ос_ИсторияИзмененияЦен
	               |ГДЕ
	               |	ос_ИсторияИзмененияЦен.Дата <= &Дата
	               |	И ос_ИсторияИзмененияЦен.НастройкаОбмена = &НастройкаОбмена";
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	Запрос.УстановитьПараметр("ДатаВыгрузки", ДатаВыгрузки);
	РезультатЗапроса = Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗаписатьИзмененияЦен(ВидЦен, Номенклатура, Характеристика) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ос_НастройкиОбменаССайтами.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ос_НастройкиОбменаССайтами КАК ос_НастройкиОбменаССайтами
	               |ГДЕ
	               |	НЕ ос_НастройкиОбменаССайтами.ПометкаУдаления
	               |	И ос_НастройкиОбменаССайтами.РегистрироватьИзмененияЦен";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписатьИзмененияЦенПоНастройкеОбмена(Выборка.Ссылка, ВидЦен, Номенклатура, Характеристика);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ЗаписатьИзмененияЦенПоНастройкеОбмена(НастройкаОбмена, ВидЦен, Номенклатура, Характеристика)
	
	МЗ = РегистрыСведений.ос_ИсторияИзмененияЦен.СоздатьМенеджерЗаписи();
	МЗ.Дата = ТекущаяДата();
	МЗ.ВидЦен = ВидЦен;
	МЗ.НастройкаОбмена = НастройкаОбмена;
	МЗ.Номенклатура = Номенклатура;
	МЗ.Характеристика = Характеристика;
	МЗ.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьИзмененияЦенДоДаты(НастройкаОбмена, ДатаОкончания) Экспорт
	
	Если ДатаОкончания = Дата(1,1,1) 
		ИЛИ ДатаОкончания = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ос_ИсторияИзмененияЦен.НастройкаОбмена КАК НастройкаОбмена,
	               |	ос_ИсторияИзмененияЦен.Номенклатура КАК Номенклатура,
	               |	ос_ИсторияИзмененияЦен.Характеристика КАК Характеристика,
	               |	ос_ИсторияИзмененияЦен.Дата КАК Дата,
	               |	ос_ИсторияИзмененияЦен.ВидЦен КАК ВидЦен
	               |ИЗ
	               |	РегистрСведений.ос_ИсторияИзмененияЦен КАК ос_ИсторияИзмененияЦен
	               |ГДЕ
	               |	ос_ИсторияИзмененияЦен.НастройкаОбмена = &НастройкаОбмена
	               |	И ос_ИсторияИзмененияЦен.Дата <= &ДатаОкончания";
	Запрос.УстановитьПараметр("НастройкаОбмена", НастройкаОбмена);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.ос_ИсторияИзмененияОстатков.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка); 
		МЗ.Удалить();
		
	КонецЦикла;
		
КонецПроцедуры
